Mathe/HA_02/HA_02_AlMaweri.tex
% Created 2020-11-18 Mi 11:21
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{braket}
\author{Daniel Geinets (), Christopher Neumann (), Dennis Schulze (458415)}
\date{\today}
\title{Analysis I und Lineare Algebra für Ingenieurwissenschaften \large  \\ Hausaufgabe 02 - Al-Maweri 13}
\hypersetup{
 pdfauthor={Daniel Geinets (), Christopher Neumann (), Dennis Schulze (458415)},
 pdftitle={Analysis I und Lineare Algebra für Ingenieurwissenschaften \large  \\ Hausaufgabe 02 - Al-Maweri 13},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\setcounter{secnumdepth}{0}
\newcommand{\tuple}[1]{\left(#1\right)}
\newcommand{\R}{\mathbb{R}}
\newcommand{\Q}{\mathbb{Q}}
\newcommand{\N}{\mathbb{N}}
\newcommand{\C}{\mathbb{C}}

\pagebreak

\section{Aufgabe 1}
\label{sec:org172840d}
\subsection{a)}
\label{sec:org8f22a02}
Zu zeigen ist
$$ \forall n \in \N, n \geq 1, \sum_{k=1}^{n} \tuple{2k - 1} = n^2 $$

IA:
    Es gilt für \(n = 1\)

$$ \sum_{k=1}^{1} \tuple{2k - 1} = (2(1) - 1) = 1 = (1)^2 $$

IB:
    Es gelte für ein beliebiges \(n \in \N\) mit \(n \geq 1\)

$$ \sum_{k=1}^{n} \tuple{2k - 1} = n^2 $$

IV:
    Damit gilt dann

$$ \sum_{k=1}^{n+1} \tuple{2k - 1} = (n + 1)^2 $$

IS:
    Es gilt

\begin{align*}
    \sum_{k=1}^{n+1} \tuple{2k - 1} &= \sum_{k=1}^{n} \tuple{2k - 1} + 2(n + 1) - 1 \\
    &= n^2 + 2(n + 1) - 1 = n^2 + 2n + 1 = (n + 1)^2
\end{align*}

Folglich gilt dann für alle \(n \in \N\) mit \(n \geq 1\)

$$ \sum_{k=1}^{n} \tuple{2k - 1} = n^2 $$

\subsection{b)}
\label{sec:org2c2a4ac}
$$ \prod_{k=2}^{n} \tuple{1 - \frac{1}{k^2}} = \frac{n + 1}{2n}, n \in \N, n \geq 2 $$

IA:
  Es gilt

\begin{align*}
    \prod_{k = 2}^{2} \tuple{1 - \frac{1}{k^2}} = \frac{2 + 1}{4}
    = \frac{3}{4}
    = 1 - \frac{1}{4}
\end{align*}

IV:
  Es gelte für ein beliebiges n \(\in\) \(\N\) mit n > 1
$$ \prod_{k=2}^{n} \tuple{1 - \frac{1}{k^2}} = \frac{n + 1}{2n} $$

IB:
  Dann gilt
$$ \prod_{k=2}^{n + 1} \tuple{1 - \frac{1}{k^2}} = \frac{n + 2}{2(n + 1)} $$

IS:
  Es gilt

\begin{align*}
    \prod_{k = 2}^{n + 1} \tuple{1 - \frac{1}{k^2}} &= \prod_{k = 2}^{n} \tuple{1 - \frac{1}{k^2}} \cdot \tuple{1 - \frac{1}{(n + 1)^2}} \\
    &= \frac{n + 1}{2n} \cdot \tuple{1 - \frac{1}{(n + 1)^2}} \\
    &= \frac{n + 1}{2n} \cdot \tuple{\frac{(n+1)^2}{(n+1)^2} - \frac{1}{(n + 1)^2}} \\
    &= \frac{n + 1}{2n} \cdot \frac{(n+1)^2 - 1}{(n+1)^2} \\
    &= \frac{n + 1}{2n} \cdot \frac{((n+1) - 1)((n+1) + 1)}{(n + 1)^2} \\
    &= \frac{n + 1}{2n} \cdot \frac{n(n + 2)}{(n + 1)(n + 1)} \\
    &= \frac{(n + 1) \cdot n(n + 2)}{2n(n + 1)(n + 1)}
    = \frac{n + 2}{2(n + 1)}
\end{align*}



Damit gilt für alle n \(\in\) \(\N\) mit n > 1
$$ \prod_{k=2}^{n} \tuple{1 - \frac{1}{k^2}} = \frac{n + 1}{2n} $$

\subsection{c)}
\label{sec:org575ed46}
$$ \forall n \in \N, n \geq 4, \text{ gilt } 2^n \geq n^2 $$

IA:
  Es gilt für n = 4

\begin{align*}
    2^4 &\geq 4^2 \\
    \Leftrightarrow 16 &\geq 16
\end{align*}

IV:
  Es gelte für ein beliebiges \(n \in \N\) mit n \(\ge\) 4
$$ 2^n \geq n^2 $$

IB:
  Dann gilt
$$ 2^{n + 1} \geq (n + 1)^2 $$

IS:
  Es gilt

\begin{align*}
    2^{n + 1} &\geq (n + 1)^2 \\
    \Leftrightarrow 2 \cdot 2^n &\geq 2 \cdot n^2 = n^2 + 2n + 1 \\
    \Rightarrow n^2 &= 2n + 1 \\
    \Leftrightarrow 0 &= n^2 - 2n - 1 \\
    \Rightarrow n_1 &= 1 - \sqrt{2} \text{ und } n_2 = 1 + \sqrt{2}, n_i \in \R \\
    \Rightarrow n_1 &< 4 \text{ und } n_2 < 4 \text{ (siehe IV.)} \\
    \Rightarrow n^2 &> 2n + 1 \\
    \Rightarrow 2 \cdot n^2 &> n^2 + 2n + 1 = (n + 1)^2 \\
    \Rightarrow 2 \cdot 2^n &> (n + 1)^2 \\
    \Leftrightarrow 2^{n + 1} &> (n + 1)^2 \\
\end{align*}


Damit gilt für alle \(n \in \N\) mit n \(\ge\) 4
$$ 2^n \geq n^2 $$

\section{Aufgabe 2}
\label{sec:org261e9f9}
\subsection{a)}
\label{sec:org6c660de}
die Exponentialfunktion ist nicht surjektiv => eine komposition mit \(\exp\) ist nicht surjektiv \\

die Exponentialfunktion ist injektiv => eine komposition mit \(\exp\) ist injektiv, wenn die andere funktion injektiv ist \\

=> \(f\) ist nur injektiv
\subsection{b)}
\label{sec:org19ec063}
die Betragsfunktion ist weder injektiv noch surjektiv => eine komposition mit der Betragsfunktion ist weder injektiv noch surjektiv \\

=> \(g\) ist weder injektiv noch surjektiv

\section{Aufgabe 3}
\label{sec:org409fc0a}
\subsection{a)}
\label{sec:orga21d949}
$$ D_{f_3} = \R \setminus \set{x \in \R | \cos(x) \neq 0} $$

\subsection{b)}
\label{sec:org4385dcc}
\begin{align*}
    (f_1 \circ f_2)(x) &= \tuple{\frac{1}{x^3}}^2 - 4 \\
    &= \frac{1}{x^6} - 4
\end{align*}

$$ D_{f_1 \circ f_2} = \R \setminus \{0\} $$

\begin{align*}
    (f_2 \circ f_1)(x) &= \frac{1}{(x^2 - 4)^3} \\
    &= \frac{1}{((x - 2)(x + 2))^3}
\end{align*}

$$ D_{f_2 \circ f_1} = \R \setminus \{-2, 2\} $$

\subsection{c)}
\label{sec:orgd131fc5}
$$ f_{1}^{-1}([0, 12]) = [2, 4] $$

\subsection{d)}
\label{sec:orga793ef1}
\section{Aufgabe 4}
\label{sec:org58b0703}
\subsection{a)}
\label{sec:org7a5f744}
\begin{align*}
    y &= \frac{x+3}{x+1} \\
    \Leftrightarrow y(x+1) &= x+3 \\
    \Leftrightarrow yx+y &= x+3 \\
    \Leftrightarrow (y-1)x+y &= 3 \\
    \Leftrightarrow x &= \frac{3-y}{y-1}, y \neq 1 \\
\end{align*}

Damit gilt

$$ f^{-1}(y) = \frac{3-y}{y-1} $$
$$ D_{f^{-1}} = \R \setminus \{1\} $$

\subsection{b)}
\label{sec:orga3f8882}
\begin{align*}
    (f \circ f^{-1})(y) &= \frac{\tuple{\frac{3-y}{y-1}}+3}{\tuple{\frac{3-y}{y-1}}+1} \\
    &= \frac{\tuple{\frac{3-y + 3y-3}{y-1}}}{\tuple{\frac{3-y + y-1}{y-1}}} \\
    &= \frac{\frac{2y}{y-1}}{\frac{2}{y-1}} \\
    &= \frac{2y}{y-1} \cdot \frac{y-1}{2} \\
    &= y \\
\end{align*}

\subsection{c)}
\label{sec:org9a3aa74}
\end{document}
